#მეთოდი არის ფუნქცია, რომელიც ეკუთვნის კონკრეტულ ობიექტს — მაგალითად სტრინგს.



name = "giorgi"
name_gio = name.upper()
print(name_gio)   # GIORGI




#კომენტარის სახით ახსენით დღევანდელ გაკვეთილზე ნასწავლი მეთოდები და მოიყვანე თითოეულზე თითო-თითო მაგალითი:



upper() -> გარდაქმნის ყველა სტრინგის ასოს დიდად.

print("hello".upper())


lower() -> გარდაქმნის ყველა სტრინგის ასოს პატარად.

print("HELLO".lower())

capitalize() -> გადააქცევს სტრინგის პირველ ასოს დიდად.

print("gAMarJoBa".capitalize()) 

find() -> ეძებს ფრჩხილებში  გადაცემულ სიმბოლოს და აბრუნებს იმის ინდექსს

print("banana".find("n"))

count() -> გვიბრუნებს შედეგს მაგალითად რამდენი მეორდება ფრჩხილებში გადაცემული სიმბოლო.
print("banana".count("a"))


isupper() -> ამოწმებს მაგალითად შედგება თუ არა სტრინგი მხოლოდ დიდი ასოებით და დააბრუნებს false ან true ს.

print("HELLO".isupper())
islower() -> ამოწმებს შედგება თუ არა სტრინგი მხოლოდ პატარა ასოებით და აბრუნებს true ან false.


startswith() -> ამოწმებს იწყება თუ არა სტრინგი ფრჩხილებში გადაცემული ასოთი თუ კი აბრუნებს true ან false.
 print("python".startswith("py"))

endswith() -> ამოწმებს მთავრდება თუ არა სტრინგი ფჩრხილებში რასაც გადავცემთ იმით და თუ სწორია დააბრუნებს true ან false.


isalnum() ამოწმებს შედგება თუ არა სტრინგი რიცხვებისგან ან ასოებისგან


isalpha() ამოწმებს შედგება თუ არა მხოლოდ ასოებისგან


isdigit() ამოწმებს შედგება თუ არა მხოლოდ რიცხებისგან


swapcase() ეს ცვლის






