#ფუნქცია არის კოდის პატარა ბლოკი რომელსაც შეუძლია რაღაც კონკრეტული მოქმედება შეასრულოს.



print()       # ეკრანზე გამოაქვს შედეგუ

input()       # მომხმარებლისგან შემოაქვს მონაცემი.

type()        # გვაჩვენებს, რა ტიპის მონაცემია (str, int, bool და ა.შ.)

int()         # სტრინგს გადაიყვანს მთელი რიცხვად

float()       # სტრინგს გადაიყვანს ათწილადად

str()         # რიცხვს/სხვა ტიპს გადააქცევს სტრინგად

range()       # ქმნის რიცხვების დიაპაზონს (for ციკლთან ერთად გამოიყენება.

bool()       # მნიშვნელობას გადააქცევს True/False-ად
  
