#კომენტარებით ახსენით რა არის სია და რამდენი მონაცემთა ტიპის შენახვა შეგვიძლია.


#სია არის ბევრი მონაცემი ერთ ცვლადში და მასში შეგვიძლია ყველა მონაცემის ტიპის ჩაწერა იქნება ეს int, float, string, bool და ა.შ



#შექმენი სია სახელად names და შეინახეთ თქვენი ოჯახის წევრების სახელები. სააბოლოოდ დაბეჭდეთ 1-ლი და 3-მე ელემენტები.


names = ["Giorgi", "Fiqria", "Gabrieli", "Dato"]

print(names[0])  
print(names[2])



#შექმენი სია სახელად numbers და შეინახეთ 10-ი რენდომ რიცხვი. სააბოლოოდ 0-ლე ინდექსზე მდგომი ელემენტი გახადეთ თქვენი სახელი.


numbers = [3, 5, 12, 23, 98, 42, 67, 14, 46, 31,]

numbers[0] = "Giorgi"

print(numbers)




