# შექმენით ფუნქცია greet და დააბრუნეთ მისასალმებელი ტექსტი return ის საშუალებით


def greet():
    return "Hello, welcome!"

message = greet()
print(message)


#შექმენით ფუნქცია add რომელსაც გადაეცემა ორი რიცხვი და შემდეგ დააბრუნეთ მათი ჯამი


def add(a, b):
    return a + b

result = add(5, 7)
print(result)


#შექმენით ფუნქცია multiply რომელსაც გადაეცემა ორი რიცხვი  შემდეგ კი დააბრუნეთ მათი ნამრავლი


def multiply(a, b):
    return a * b

result = multiply(4, 6)
print(result)



#ახსენით რა არის არგუმენტი და რა არის პარამეტრი,ასევე რატომ ვიყენებთ ფუნქციებს

#პარამეტრი არის ცვლადი რომელსაც ვწერთ ფუნქციის შექმნისას.
#არგუმენტი არის რეალური მნიშვნელობა, რომელსაც ფუნქციას გადავცემთ გამოძახებისას.


#შექმენი ფუნქცია სახელად filter რომელსაც გადაეცემა რიცხვი, თქვენი დავალებაა შეამოწმოთ ეს რიცხვი ლუწია თუ კენტი და დააბრუნოთ შესაბამისი შედეგი even ან odd

def filter(number):
    if number % 2 == 0:
        return "even"
    else:
        return "odd"
