#def ქმნის ფუნქციას  პატარა პროგრამას პროგრამის შიგნით ჩვენ ვქმნით და არ გვიწევს ბევრი კოდის წერა.


def add(a, b):
    return a + b



#if elif და else გამოიყენება პირობების შესამოწმებლად და სხვადასხვა ქმედებების შესასრულებლად სხვადასხვა პირობების მიხედვით.






#for ციკლი თითო ელემენტს სათითაოდ გადაუვლის.

numbers = [1, 2, 3]

for x in numbers:
    print(x)




#while ციკლი  სანამ პირობა ჭეშმარიტია, კოდი განმეორდება.


x = 0

while x < 3:
    print(x)
    x += 1



#and / or /  — ლოგიკური ოპერატორები პირობების შემოწმებისთვის.

#and ორივე უნდა იყოს true 

x = 5

if x > 0 and x < 10:
    print("")




#or  ერთი მიანც უნდა იყოს true.

if x < 0 or x > 100:
    print("ზღვარს გარეთაა")




#tuple უცვლელი სია.


colors = ("red", "green", "blue")

print(colors[0])






#dictonary ინახავს მონაცმეს სახელიტ ა და მნიშვნელობით.


person = {
    "name": "Giorgi",
    "age": 18,
    "city": "Tbilisi"
}




