#კომენტარებით ახსენი რას აკეთებს len() ფუნქცია და მოიყვანე მაგალითი.

#len() ფუნქცია აბრუნებს კოდის სიგრძეს, ანუ რამდენი ელემენტი აქვს მას.


text = "hello"
print(len(text))




#კომენტარებით ახსენით დღევანდელ გაკვეთილზე ნასწავლი სიის მეთოდები და მოიყვანეთ თითო-თითო მაგალითები:
#.append()
#.insert()
#.pop()



#append() ამატებს ერთ ახალ ელემენტს სიის ბოლოში მაგალითად:

numbers = [1, 2, 3]
numbers.append(4)
print(numbers)


# insert() ამატებს კონკრეტულ ინდექსზე ელემნტს.

numbers = [1, 2, 3]
numbers.insert(1, 100)
print(numbers)




#pop()  აშორებს და აბრუნებს ელემენტს სიიდან თუ ინდექსს არ მიუთითებ  ბოლო ელემენტს შლის.


numbers = [1, 2, 3]
numbers.pop()
print(numbers)








#შექმენი სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის მნიშვნელობას. საბოლოოდ სიის ბოლოს დაამატეთ თქვენი სახელი.



my_list = [10, 3.14, "hello", True]

my_list.append("Gio")

print(my_list)







#შექმენი სია სადაც შეინახავთ თქვენი ოჯახის წევრების სახელებს. საბოლოოდ 2-ე ინდექსზე მდგომი ელემენტი შეცვალეთ თქვენი საყვარელი ცხოველის სახელი.



my_family = ["fiqria", "gabrieli", "dato", "giorgi"]

my_family.insert(1, max)

print(my_family)






# შექმენით სია სადაც გექნებათ რიცხვები 1 დან 10-ის ჩათვლით. საბოლოოდ წაშალეთ 4-ე ინდექსზე მდგომი ელემენტი



numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

numbers.pop(4)

print(numbers)
