#გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ

#გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით

#გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე

#ამ დავალებების შესასრულებლად გამოიყენეთ for loop-ი


#whiile loops:

#გამოიტანეთ რიცხვები 10-დან 15-მდე
#გამოიტანეთ რიცხვები 50-დან 0-მდე
#გამოიტანეთ მხოლოდ ლუწი რიცხვები 10-დან 70-მდე
#გამოიტანეთ კენტი რიცხვები 25-დან 55-მდე


name = "Giorgi Sichinava"
age = 17

for i in range(age):
    print(name)


i = 1

for i in range(1,21):
    print(i)




for i in range(20,-1 -1):
    print(i)




i = 10

while i <= 15:
    print(i)
    i = i + 1





i = 50

while i >= 0:
    print(i)
    i = i - 1





i = 10

while i <= 70:
    print(i)
    i = i + 2






i = 25

while i <= 55:
    print(i)
    i = i + 2
