#შექმენით 5 ელემენტიანი Tuple და unpacking ის გამოყენებით თითოეულ ელემენტს მიანიჭეთ შესაბამისი ცვლადი
my_tuple = (10, 20, 30, 40, 50)

a, b, c, d, e = my_tuple

print(a)
print(b)
print(c)
print(d)
print(e)





#ახსენით კომენტარებით რა არის tuple და რით განსხვავდება ის list ისგან

# tuple იმით განსხვავდება list ისგან რომ მისი შეცვლა აღარ შეგვიძლია შექმნის შემდეგ list ში შეგვიძლია ასევე ვიყენებთ ესეთ ფრჩხილებს () და არა []




#შექმენით 6 ელემენტიანი tuple და გამოიყენეთ .index() და .count() მეთოდები

my_tuple = (5, 10, 5, 20, 5, 30)


print(my_tuple.index(5))   

print(my_tuple.count(5))   


#ახსენით რა არის *rest

#*rest (ან ზოგადად * Python-ში) გამოიყენება unpacking-ის დროს, რომ „დარჩენილი“ ელემენტები ერთ ცვლადში შეინახოს.





