# შექმენი ფუნქცია greet და დააბრუნე მისასალმებელი ტექსტი return-ის საშუალებით

def greet():
    return "Hello, welcome!"

message = greet()
print(message)


# შექმენი ფუნქცია add რომელიც დააბრუნებს ორი რიცხვის ჯამს

def add(a, b):
    return a + b

result = add(5, 7)
print(result)


# შექმენი ფუნქცია multiply რომელიც დააბრუნებს ორი რიცხვის ნამრავლს

def multiply(a, b):
    return a * b

result = multiply(4, 6)
print(result)



# ახსენი რა არის არგუმენტი და რა არის პარამეტრი, ასევე რატომ ვიყენებთ ფუნქციებს
# პარამეტრი არის ცვლადი, რომელიც ფუნქციის შიგნით გამოიყენება.
# არგუმენტი არის რეალური მნიშვნელობა, რომელსაც ფუნქციას გადაცემისას ვაწვდით.

# შექმენი ფუნქცია სახელად filter რომელიც მიიღებს რიცხვს,
# შემდეგ დაადგენს შემოსული ეს რიცხვი ლუწია თუ კენტი
# და დააბრუნებს შესაბამის შედეგს even ან odd

def filter(number):
    if number % 2 == 0:
        return "even"
    else:
        return "odd"
