
#დაწერე პროგრამა, რომელიც while ციკლის მეშვეობით ბეჭდავს რიცხვებს 1-დან 10-მდე.

#დაწერე პროგრამა, რომელიც while ციკლით ბეჭდავს რიცხვებს უკუღმა — 10-დან 1-მდე.


#დაწერე პროგრამა, რომელიც ითხოვს მომხმარებლისგან სახელს და არ ჩერდება მანამ, სანამ სწორ სახელს არ შეიყვანს.თუ მომხმარებელი შეიყვანს სხვა სახელს, პროგრამამ უნდა სთხოვოს თავიდან შეიყვანოს.როდესაც სწორი სახელი იქნება შეყვანილი — პროგრამამ უნდა დაბეჭდოს, რომ პასუხი სწორია.





i = 1

while i <= 10:
    print(i)
    i = i + 1  




i = 10


while i >= 1:
    print(i)
    i = i - 1 




user_name = "giorgi"

name = input("type your name:")

while name != user_name:
    print("error try again!")
    name = input("type your name:")

print("correct")







