#კომენტარებით ახსენი რა არის sequencing, iteration და selection-ი მოიყვანე მაგალითები.

#კომენტარებით ახსენი რა არის საიტერაცი ცვლადი.
# შექმენი ფორ ციკლი რომელიც გამოიტანს 1-დან 20 ამდე რიცხვებს და ყოველ იტერაციზე უნდა დაემატოს(step) 2-იანი ანუ კენტი რიცხვები.
# შექმენი ფორ ციკლი რომელიც გამოიტანს 0-დან 50 ამდე რიცხვებს და ყოველ იტერაციზე უნდა დაემატოს(step) 2-იანი ანუ ლუწ რიცხვები.
#შექმენი ციკლი სადაც გამოიტან შენ სახელს 15 ჯერ.



#sequencing არის მიმდევრობა 
#iteration არის კოდის რამოდენიმეჯერ გამეორება
#selection არის არცევს თუ რომელი ვარიანტი გაეშვას.


#საიტერაციო ცვლადი ცვლადი,რომელიც ყოველი იტერაციის (გამეორებისას) იღებს ახალ მნიშვნელობას.


for i in range(1, 21, 2):
    print(i)


for i in range(0,50, 2):
    print(i)

for i in range(15):
    print("Giorgi")
    





