# ოჯახის წევრების ასაკები
deda = int(40)
mama = int(41)
dzma = int(10)

# შედეგი
print("25 წლის შემდეგ დედა იქნება", deda + 25, "წლის.")
print("25 წლის შემდეგ მამა იქნება", mama + 25, "წლის.")
print("25 წლის შემდეგ ძმა იქნება", dzma + 25, "წლის.")




# მომხმარებლის სახელის შეყვანა
name = input("type your name: ")

# მონაცემის ტიპის შემოწმება
print(type(name))


# მომხმარებლის ასაკის შეყვანა
age = input("type your age: ")



# int ტექსტს ან ათწილადს გადააქცევს მთელ რიცხვად.

# float() ტექსტს ან მთელი რიცხვს გადააქცევს ათწილადად.

# str() ნებისმიერ მონაცემს გადააქცევს ტექსტად.