#შექმენი ცვლადი სადაც შეინახავ შენს საყვარელ სპორტის სახელს შემდეგ for ციკლით გადაუარეთ ცვლადს და გამოიტანეთ თქვენი სახელი ცალ-ცალკე.

sport = "football"

for i in sport:
    print(i)


#შექმენი while ციკლი. სადაც გამოიტან რიცხვებს 1 დან 100 მდე და ყოველ იტერაციაზე უნდა დაუმატო 4-იანი.


i = 1

while i <= 100:
    print(i)
    i = i + 4


# შექმენი for ციკლი სადაც გამოიტან 1-დან  499 ის ჩათვლით ლუწ რიცხვებს.

for i in range(2, 500, 2):
    print(i)


#დაწერე პროგრამა, რომელიც ითხოვს მომხმარებლის საყვარელ რიცხვს და არ ჩერდება მანამ, სანამ სწორ რიცხვს არ შეიყვანს.თუ მომხმარებელი შეიყვანს სხვა ციფრს, პროგრამამ უნდა სთხოვოს თავიდან შეიყვანოს.როდესაც სწორი რიცხვი იქნება შეყვანილი — პროგრამამ უნდა დაბეჭდოს, რომ ეს პასუხი სწორია.


favorite_number = 7   

number = int(input("type number:"))

while number != favorite_number:
    print("try again")
    number = int(input("type number:"))

print("correct")







#for ციკლის საშუალებით 0 დან 20 მდე დაპრინტე ყველა ლუწი რიცხვი.

for i in range(0, 20, 2):
    print(i)



#for ციკლის საშუალებით 1 დან 20 მდე დაპრინტე ყველა კენტი რიცხვი..

for i in range(1, 21, 2):
    print(i)



#while ციკლის დახმარებით 0 დან 20მდე დაპრინტეთ ყველა ლუწი რიცხვი.

i = 0

while i <= 20:
    print(i)
    i = i + 2
