#ჩამოწერეთ აქამდე ნასწავლი ფუნქციები, თქვენი დავალებაა: დაწეროთ რომელი არ გამოიტანს ეროს თუ არგუმენტში არ გადავცემთ არაფერს. და რომელი გამოიტანს ერორს, აუცილებლად მოიყვანეთ მაგალითი და ახსენით დეტალურად.


range()
#გამოიტანს error ს თუ ცარიელია


int()
#არ გამოიტანს error ს თუ არგუმენტი არ აქვს.

float()
#აქაც იგივე არ გამოიტანს error ს.


input()
#მუშაობს


len()
#error






#კომენტარებით ახსენი როდის ვიყენებთ დოტნოტაციას(dot notation).



#დოტნტაცია გამოიყენება მაშინ როცა ობიექტზე უნდა გამოვიძახოთ ფუნქცია. 





#შექმენი ცვლადი სადაც შეინახავ შენს სახელს, რომელიც გეწერება პატარა ასოებით, გამოიყენე მეთოდი რომელიც გაადიდებს თქვენი სახელის ასოებს



name = "Giorgi"
print(name.upper())






# შექმენი ცვლადი სადაც შეინახავ შენი საყავრელი სპორტის სახელს დიდი ასოებით. გამოიყენე მეთოდი რომელიც დააპატარავებს.


sport = "BASKETBALL"
print(sport.lower())









