# მომხმარებელს შემოატანინინე 1 დან 20 ამდე ნებისმიერი რიცხვი. თუ მომხმარებლის შემოყვანილი რიცხვი ნაკლებია 10 ზე ან მეტია ოცზე მაშინ დაპრინტე "good". ხოლო სხვა შემთხვევაში დაპრინტე "bad"


number = int(input("type random number: "))

if number < 10 or number > 20:
    print("good")
else:
    print("bad")










# კომენტარებით ახსენით რას აკეთებს if, elif, else.

# მომხმარებელს შემოატანინე შენი ასაკი. თუ შენი ასაკი მეტია ან ტოლი 18 ზე მაშინ დაპრინტე "სრულწლოვანი". ხოლო სხვა შემთხვევაში დაპრინტე არასრულწლოვანი.

# მომხმარებელს შემოატანინე ნებისმიერი რიცხვი. თუ მომხმარებლის შემოყვანილი რიცხვი იყოფა 2-ზე და ნაშთი რჩება 0-ი დაპრინტე Even. ხოლო სხვა შემთხვევაში დაპრინტე Odd.

# მომხმარებელს შემოატანინე ქულა 1 დან 10-მდე თუ მომხმარებლის შეყვანილი ქულა მეტია ან ტოლი 8-ზე მაგ შემთხვევაში დაპრინტე "თქვენ წარმატებით ჩააბარეთ გამოცდა". ხოლო სხვა შემთხვევაში "თქვენ ჩაიჭერით.


#if ამოწმებსს ჩვენ მიერ დაწერილ პირველ პირობას.
#elif იც შემამოწმებელია თუ პირველი პირობა არ შესრულდა, მაშინ შეამოწმებსს შემდეგს.
#else კი  შესრულდება მაშინ, როცა არც ერთი if elif პირობა არ იყო True


age = int(input("type your age:"))

if age >= 18:
    print("სრულწლოვანი")
else:
    print("არასრულწლოვანი")





number = int(input("type random number:"))

if number % 2 == 0:
    print("Even")
else:
    print("Odd")




score = int(input("ჩაწერეთ გამოცდის შედეგი: "))

if score >= 8:
    print("თქვენ წარმატებით ჩააბარეთ გამოცდა")
else:
    print("თქვენ ჩაიჭერით")


